[
    {
        "content": "<p>Edit: \"As a similar idea to the one of making a research seminar on Color Logic\", why not making an online seminar on category theory where in particular, you could talk about Color Logic as much as you want? I would be very motivated into parcipitating in such a seminar, even be invested into the organization. One reason is that I wanted to make our friend <span class=\"user-mention\" data-user-id=\"661732\">@Felix Dilke</span>, who made his programming language Bewl dedicated to toposes, invited at the logic seminar of the University of Ottawa, but my request has been completely ignored so I think that it would be good to create a seminar which is based on more modern principles: let anybody who has something valuable to say talk, promote collaboration, help people to learn etc... There could be research talks and also lot of tutorials to help people learn. Maybe even some talks open to lot of people on the basics of category theory. And of course, if it is online, it will be for people from anywhere around the earth.</p>",
        "id": 400987781,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1699463209
    },
    {
        "content": "<p>Ok, good, maybe we can do another topic with \"moved\". I don't know how to do this. We are already 2 people motivated by this <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 400989177,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1699463710
    },
    {
        "content": "<p>Ok, I understood how to do this</p>",
        "id": 400989253,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1699463740
    },
    {
        "content": "<p>5 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"229111\" href=\"/#narrow/stream/229111-community.3A-general/topic/wiki.3A.20Color.20Logic\">#community: general &gt; wiki: Color Logic</a> by <span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span>.</p>",
        "id": 400989379,
        "sender_full_name": "Notification Bot",
        "timestamp": 1699463779
    },
    {
        "content": "<p>If you're interested in such a project, please indicate it by putting a <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> below. It would be useful only if people are interested.</p>",
        "id": 400991050,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1699464407
    },
    {
        "content": "<p>I would be interested into inviting people to make tutorials on lots of current research topics which are either in category theory or at least loosely linked to category theory such as:</p>\n<ul>\n<li>Probability/satistics with category theory</li>\n<li>Differential categories</li>\n<li>Formal category theory </li>\n<li>Curry-Howard-Lambek correspondence</li>\n<li>Categorification</li>\n<li>Categorical database theory</li>\n<li>Algebraic geometry (in particular category-theoretic approaches)</li>\n<li>Model theory (for instance Makkai's work)</li>\n<li>Theory of programming languages</li>\n<li>Uses of category theory in current research in abstract algebra</li>\n<li>Homotopy theory</li>\n<li>Toposes</li>\n<li>Category theory in theoretical physics (for instance Schreiber's and co kind of work)</li>\n<li>etc...<br>\nThe goal is to make them easier to learn by anyone interested.</li>\n</ul>",
        "id": 400992862,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1699465050
    },
    {
        "content": "<p>I would want it to be a place to help people learn effectively, not just to promote each person's own research. There could also be classic research talks. Also talks to present ongoing or finised master/phd thesis and talks about category theory in industry.</p>",
        "id": 400993893,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1699465417
    },
    {
        "content": "<p>I'm glad that a good bunch of people are interested! I'm thus planning to try starting this seminar. I'm going to ask various people if they would want to make talks and then I think it could start at the beginning of January. I think it will be a weekly seminar and we'll decide before it starts on what day and at what time it will happen. It could be a fixed time or maybe a various time but only on the same day, for instance say, on Wednesday. I'll contact again the potential speakers to fix a schedule when we know at what time and day we want the seminar to happen. I'll likely put the schedule on a nlab page and also announce occurences of the seminar on Zulip. Recordings of the talks should be put on a YouTube channel.</p>\n<p>The time will likely be more adapted for people in America but we'll see depending on who wants to come.  </p>\n<p>I would like that the talks are made in a somehow logical order on a more or less fixed theme for some period of time. For instance, I'd like to start with talks on everything related to topology and category theory. For example there could be tutorials on each of these topics: sheaf theory, toposes,  Bewl, locales, Scott topology,  homotopy theory, homotopy type theory, schemes, <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi>A</mi><mn>1</mn></msup></mrow><annotation encoding=\"application/x-tex\">A^1</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8141em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">A</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span></span></span></span></span></span></span></span></span>-homotopy theory. We could have research talks at the end on recent progresses. Hopefully, such a theme will take a few weeks or months to cover and after that we'll switch to something else. Say for instance geometry and category theory, or higher categories, or Curry-Howard or anything else.</p>\n<p>We could maybe decide democratically of the themes to cover and who to invite. Anyway, all the people interested can share their toughts here.</p>",
        "id": 401196916,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1699548375
    }
]